Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: "data" - The data package string
zh_cn: "data" － 字符串格式的数据包

source: "message" - The message body text
zh_cn: "message" － 消息正文

source: "title" - The title of the notification (this will only be available on the Android platform as iOS does not store the title information)
zh_cn: "title" － 通知的标题 ( 仅在Android 平台可用 ， iOS 平台不保存标题信息)

source: "Exit" simply ends the execution of the current script or event.
zh_cn: “Exit”简单的结束当前脚本或事件的运行。

source: "break" in a for loop:
zh_cn: for 循环中的“break”：

source: "break" in a repeat loop:
zh_cn: repeat 循环中的“break”：

source: "break" in a while loop:
zh_cn: while循环中的“break”：

source: "break" when using with:
zh_cn: with中的“break”：

source: (You can download this version of DirectX from the Microsoft website at: http://www.microsoft.com.) When designing and testing games, the memory requirements can be pretty high (at least 128 MB and preferably more, but this depends on the operating system).
zh_cn: (您可以从以下网站: http://www.microsoft.com下载DirectX 9.)，对内存要求会很高 (至少128MB或更多，取决于操作系统)。

source: (not): not, turns true into false and false into true
zh_cn: (not): 否，“true”转换为“false”，“false”转换为“true”。

source: - Device Input
zh_cn: - 设备输入

source: - GamePad Input
zh_cn: - 游戏手柄输入

source: - Getting Started With Source Control
zh_cn: - 源代码管理入门

source: - Image Loaded and Sound Loaded Events
zh_cn: - 图片载入和声音载入事件

source: - Immersion Haptics
zh_cn: - 触觉反馈

source: - Keyboard Input
zh_cn: - 键盘输入

source: - Local High Scores
zh_cn: - 本地高分榜

source: - Mouse Input
zh_cn: - 鼠标输入

source: - Virtual Keys
zh_cn: - 虚拟键

source: - Achievements and Leaderboards
zh_cn: - 等级和成就

source: - Advertising
zh_cn: - 广告

source: - Alarm Events
zh_cn: - 时钟事件

source: - Analytics
zh_cn: - 数据分析

source: - Asynchronous Events
zh_cn: - 异步事件

source: - Backgrounds
zh_cn: - 背景

source: - Cloud Event
zh_cn: - 云事件

source: - Collision Event
zh_cn: - 碰撞事件

source: - Collisions
zh_cn: - 碰撞

source: - Control Actions
zh_cn: - 控制动作

source: - Create Event
zh_cn: 创建事件

source: - Creating an Extension
zh_cn: - 创建扩展

source: - Designing Tiles
zh_cn: - 设计图块

source: - Destroy Event
zh_cn: - 摧毁事件

source: - Dialogs Event
zh_cn: - 对话框事件

source: - Draw Event
zh_cn: - 绘制事件

source: - Drawing 3D
zh_cn: - 绘制 3D

source: - Drawing Basic Forms
zh_cn: - 绘制基本图形

source: - Drawing Primitives
zh_cn: - 绘制图元

source: - Drawing Sprites And Backgrounds
zh_cn: - 绘制精灵图和背景

source: - Drawing Surfaces
zh_cn: - 绘制表面层

source: - Drawing Text
zh_cn: - 绘制文字

source: - Editing Collision Masks
zh_cn: - 编辑碰撞遮罩

source: - Editing Sprites
zh_cn: - 编辑精灵

source: - Editing Subimages
zh_cn: - 编辑子图

source: - Editors
zh_cn: - 编辑器

source: - Extra Actions
zh_cn: - 额外动作

source: - File System Limits
zh_cn: - 文件系统限制

source: - Fixtures
zh_cn: - 固定装置

source: - Fonts
zh_cn: - 字体

source: - Forces
zh_cn: - 力

source: - Forms
zh_cn: - 窗口

source: - General
zh_cn: - 常规

source: - Grids
zh_cn: - 栅格数据

source: - HTTP Event
zh_cn: - HTTP 事件

source: - IAP (In App Purchases) Event
zh_cn: - IAP（应用内购）事件

source: - In App Purchases
zh_cn: - 应用内购

source: - Instances
zh_cn: - 实例

source: - Joints
zh_cn: - 连接

source: - Keyboard Events
zh_cn: - 键盘事件

source: - Legacy Extensions
zh_cn: - 过时的扩展

source: - Licensing
zh_cn: - 授权

source: - Lists
zh_cn: - 列表

source: - Main Actions, Set 1
zh_cn: - 主动作集1

source: - Main Actions, Set 2
zh_cn: - 主动作集2

source: - Maps
zh_cn: - 配对数据

source: - Motion Planning
zh_cn: - 运动设计

source: - Move Actions
zh_cn: - 运动动作

source: - Movement
zh_cn: - 移动

source: - Networking Event
zh_cn: - 网络事件

source: - Object Physics Properties
zh_cn: - 物体的物理属性

source: - Objects
zh_cn: - 物体

source: - Other Events
zh_cn: - 其他事件

source: - Parents
zh_cn: - 父对象

source: - Particle Emitters
zh_cn: - 粒子发射器

source: - Particle Systems
zh_cn: - 粒子系统

source: - Particle Types
zh_cn: - 粒子类型

source: - Paths
zh_cn: - 路径

source: - Physics Variables
zh_cn: - 物理变量

source: - Physics
zh_cn: - 物理

source: - Primitive Building
zh_cn: - 图元构建

source: - Priority Queues
zh_cn: - 优先队列

source: - Profiling
zh_cn: - 性能分析

source: - Project Info
zh_cn: - 项目信息

source: - Push Notifications Event
zh_cn: - 推送事件

source: - Queues
zh_cn: - 队列

source: - Real Number Functions
zh_cn: - 实数函数

source: - Rooms
zh_cn: - 房间

source: - Score Actions
zh_cn: - 分数动作

source: - Scripts
zh_cn: - 脚本

source: - Setting Up GameMaker: Studio For Source Control
zh_cn: - 配置 GameMaker: Studio 的源代码管理

source: - Settings
zh_cn: - 设置

source: - Shader Constants
zh_cn: - 着色器常量

source: - Simple Effects
zh_cn: - 简单的效果

source: - Social Event
zh_cn: - 社交事件

source: - Sounds
zh_cn: - 声音

source: - Source Control
zh_cn: - 源代码管理

source: - Sprites
zh_cn: - 精灵图

source: - Stacks
zh_cn: - 推栈

source: - Steam Event
zh_cn: - Steam 事件

source: - Step Events
zh_cn: - 步事件

source: - Texture Groups
zh_cn: - 纹理组

source: - Texture Pages
zh_cn: - 纹理页

source: - The Debug Module
zh_cn: - 调试模块

source: - The Edit Menu
zh_cn: - 编辑菜单

source: - The File Menu
zh_cn: - 文件菜单

source: - The Game Window
zh_cn: - 游戏窗口

source: - The Help Menu
zh_cn: - 帮助菜单

source: - The Marketplace Menu
zh_cn: - 市场菜单

source: - The Physics World
zh_cn: - 物理世界

source: - The Resources Menu
zh_cn: - 资源菜单

source: - The Run Menu
zh_cn: - 运行菜单

source: - The Scripts Menu
zh_cn: - 脚本菜单

source: - Tiles
zh_cn: - 图块

source: - Timelines
zh_cn: - 时间轴

source: - Using Source Control with GameMaker: Studio
zh_cn: - 在 GameMaker: Studio 中使用源代码管理

source: - Using Variables and Expressions in Actions
zh_cn: - 在动作中使用变量和表达式

source: - Using an Extension
zh_cn: - 使用扩展

source: - Vector Functions
zh_cn: - 矢量函数

source: - Vertex Formats
zh_cn: - 顶点格式

source: - Views
zh_cn: - 视野

source: - Web Server
zh_cn: - 服务器

source: - Windows 8 Phone
zh_cn: - Windows 8 手机

source: - colour And Blending
zh_cn: - 颜色和混合模式

source: --- > application surface created and render target set
zh_cn: --- > 应用表面层创建及渲染目标设置

source: --- > the application surface is now drawn to the back buffer by default (although you can switch this off)
zh_cn: --- > 应用表面层现在绘制到默认的背面缓存区（虽然你可以关掉这个过程）。

source: --- > the application surface target is reset here
zh_cn: --- > 应用表面层在此重置

source: //Create the array for (var i = 9; i > -1; i--;)
zh_cn: for (var i = 9; i > -1; i--;) // 创建数组

source: //Delete the array a = 0;
zh_cn: a = 0; //删除数组

source: 1D Arrays
zh_cn: 一维数组

source: 2D Arrays
zh_cn: 二维数组

source: 4GB RAM minimum
zh_cn: 最小 4GB 内存

source: 6.5GB of disk space
zh_cn: •6.5GB 磁盘空间

source: Introduction
zh_cn: GMS介绍

source: Oracle Java JDK (v6 or above) installed (do not use OpenJDK)
zh_cn: •安装 Oracle Java JDK (v6 或以上) (not 使用 OpenJDK)

source: Advanced Use
zh_cn: 进阶使用

source: Using GameMaker
zh_cn: 使用 GameMaker

source: Reference
zh_cn: GML参考

source: "description": The description of the last uploaded file.
zh_cn: "description": 上传的最后一个文件的描述。

source: "errorString": returns an Error String for any error.
zh_cn: "errorString": 返回的错误消息。

source: "id": The id which was returned from the called function.
zh_cn: "id": 返回被调用的函数的id，

source: "resultString": This holds a string which is the data blob returned from the cloud.
zh_cn: "resultString": 从云端返回的二进制数据。

source: "status": This holds the status code, where a negative value denotes an error, a description of which will be contained in the “errorString”.
zh_cn: "status": 这是状态码，其中负值表示错误，错误详情包含在“errorstring”中。

source: &&, ||, ^^ (and, or and xor) - Combine Boolean values to give either true or false.
zh_cn: &&, ||, ^^（与、或和异或） - 将两个布尔值结合在一起判断是真还是否。

source: ++, -- - Add or subtract one from a value.
zh_cn: ++, -- - 递加或递减一。

source: ++a will increment the variable and return the incremented value.
zh_cn: ++a 递增变量并返回增加后的值。

source: +, -, *, / - Add, subtract, multiply and divide.
zh_cn: +, -, *, / - 加，减，乘和除。

source: -: negates the next value
zh_cn: -: 取相反数，比如“a = 100; b = -a; // b = -100;”

source: <, <=, ==, !=, >, >= - These are comparisons and can only give a true or false result (where true can also be interpreted as 1, and false as 0).
zh_cn: <, <=, ==, !=, >, >= - 这些都是比较运算，且只会得出 true 或者 false 的结果（true = 1，false = 0）。

source: = - Used to assign a value to a variable.
zh_cn: = - 用来给一个变量赋值。

source: About GameMaker: Studio: Gives information about this version of GameMaker: Studio, including the product key and the user it's registered to.
zh_cn: 关于 GameMaker: Studio: 关于该版本 GameMaker: Studio 的信息，包括产品密钥、注册用户。

source: Add.
zh_cn: Add 添加.

source: Anchor: The Anchor letter in the IDE name for the keyboard shortcut.
zh_cn: 锚: 在集成开发环境里的锚字母键盘快捷键。

source: Be careful with your while loops! You can easily make infinite loops, in which case your game will hang and not react to any user input anymore.
zh_cn: 请小心你的while循环！ 它很容易就能造成无限循环，在这种情况下你的游戏将被挂起并且不再响应任何的用户输入。

source: Bookmarks: From here you can access any of the bookmarks that you may have set in your code and scripts (you can bookmark a script or code action using <Shift> + <Control> + <NUM> , where <NUM> is a number from 0 to 9 on the keyboard).
zh_cn: 书签: 从这里你可以访问任何设置了书签的代码或脚本 (你可以用<Shift> + <Control> + <NUM> 为脚本或代码设置书签，其中 <NUM> 是键盘上 0 - 9 之中的一个数字)。

source: Change.
zh_cn: Change 修改.

source: Clear.
zh_cn: Clear 清空.

source: Collapse Resource Tree: .
zh_cn: 折叠资源树: .

source: Confirm: Clicking this button will close the path editor and save any changes you have made.
zh_cn: 确认 : 点击这个按钮会保存当前路径设置并且关闭路径编辑器。

source: Create Application: Once your game is ready you will probably want to give it to others to play!
zh_cn: 生成应用程序: 一旦你的游戏制作好，就可以使用此命令创建独立程序。

source: Debug: From here you can pause or play the game being debugged, or you can toggle a breakpoint on or off.
zh_cn: Debug:在这里你可以暂停或者启动你正在调试的游戏，或者你也可以把断点切换成打开或者关闭的状态。

source: Delete: Deletes the currently selected resource (or group of resources) from the resource tree.
zh_cn: 删除: 删除当前选择的资源 (或资源组) 。

source: Delete.
zh_cn: Delete 删除.

source: Demos: This will allow you to view demo files that come with GameMaker: Studio.
zh_cn: 演示: 允许你查看 GameMaker: Studio 演示文件。

source: Duplicate: This makes a copy of the currently selected resource in the resource tree.
zh_cn: 复制： 创建当前选择资源的副本。

source: Duplicate.
zh_cn: Duplicate 复制.

source: Events.
zh_cn: 事件.

source: Exit: We know that making games is fun and addictive, but you need to eat and sleep sometimes!
zh_cn: 退出: 我们知道做游戏非常有趣而且容易上瘾，但你需要吃和睡！

source: Expand Resource Tree: Each section (and sub-folder within) of the resource tree can be collapsed when not in use to allow more space on screen for other resources.
zh_cn: 展开资源树: 资源树中的节点在屏幕没有空间显示的时候会折叠，

source: Export Project: Exports your project as a compressed GameMaker file with the format *.gmz.
zh_cn: 导出工程: 导出 *.gmz 压缩格式 Gamemaker 文件。

source: File: Here you can attempt to reconnect the debug module to your game should the connection be lost, or exit the debug module (which will not exit your game, only the module).
zh_cn: File:当你的游戏和调试模块连接断掉的时候，你可以在此尝试重连接，或者也可以在此选择退出调试模块。（不过这样不会退出游戏，仅仅是调试模块而已）

source: Find Resource: This searches through the resource tree looking for the name of the resource that you request.
zh_cn: 查找资源: 按照名称搜索资源。

source: Forum: This will connect you to the GameMaker Community (GMC) forum, where you can find help with any problem as well as tutorials, resources and much more all related to GameMaker: Studio.
zh_cn: 论坛: 会打开 GameMaker交流论坛 (GMC)，在这里你可以找到任何问题的帮助如教程、资源或更多涉及到 GameMaker: Studio的内容。

source: Friends Only - The game will only be visible in searches to you, your friends, and Steam administrators.
zh_cn: 只允许好友可见 - 你、Steam 管理员和你的好友可以看到。

source: GameMaker: Studio Preferences
zh_cn: GameMaker: Studio 首选项

source: Help: Opens up your browser, taking you to the YoYo Games Helpdesk.
zh_cn: Help:打开你的浏览器，给你看YoYoGames官网的服务台。

source: Helpdesk: This link will take you to the YoYo Games Helpdesk and Knowledge Base where you can find additional tutorials and FAQs, as well as ask questions about the product.
zh_cn: 服务台: 此链接将带你到 YoYo Games 服务台 和 知识库 中，在这里你可以找到更多的教程和常见问题解答，以及询问有关产品的问题。

source: Import: Here you can load up the compressed *.gmz project files and also import game files created with other versions of GameMaker, including GameMaker 6 (*.gm6), GameMaker 7 and 8 (*.gmk and *.gm81) as well as GameMaker 8.1 (*.gm81) and much older (*.gmd) files.
zh_cn: 导入: 这个选项卡里你可以加载 *.gmz 工程或者导入其他版本 GameMaker 的文件,包括 GameMaker 6 (*.gm6)， GameMaker 7 和 8 (*.gmk 和 *.gm81) 以及 GameMaker 8.1 (*.gm81) 或者更老的 (*.gmd) 文件。

source: Import: Imports a GameMaker: Studio *.gmz compressed file (which will then be saved as a standard *.gmx) game file.
zh_cn: 导入: 导入 GameMaker: Studio 的 *.gmz 格式文件 (将会被保存为标准的 *.gmx 格式)。

source: Insert Group: Inserts a sub-folder within the resource tree.
zh_cn: 插入组: 在资源树插入一个新的子文件夹。

source: Insert...: inserts a new resource of the type currently selected.
zh_cn: 插入...: 插入当前选择类型的新资源。.

source: Instance Creation Code As well as the code you insert into the events of an object, you can also add code to individual instances when you place them in the room.
zh_cn: 实例创建时代码（Instance Creation Code） 正如你在对象的创建事件中加入的代码片段，你也可以给放置在房间中的对象实例，加入特有的脚本。

source: Key Bindings: This option opens the Key Binding Editor where you can redefine the GameMaker: Studio keyboard shortcuts.
zh_cn: 热键设定: 此选项会打开 热键设定编辑器，在这里你可以重定义 GameMaker: Studio 的键盘快捷键，

source: Key: The key (or key combination) to be assigned to the shortcut command.
zh_cn: 快捷键: 为命令分配的按键 (或组合键)。

source: Knowledge Base: This will take you to the GameMaker Knowledge Base where you can find plenty of official information about the use of GameMaker products.
zh_cn: 知识库: 这将会打开 GameMaker 知识库，在这里你可以找到更多关于 GameMaker 产品的官方信息。

source: Licenses: This tab will display the GameMaker: Studio license, as well as all the various third party licenses of products that are used.
zh_cn: 许可: 这个选项卡显示 GameMaker: Studio 的许可，以及所有使用的第三方产品的许可。

source: Merge.
zh_cn: Merge 合并.

source: NOTE: Audio groups can only be used when working with the normal audio system, but will not work with legacy audio.
zh_cn: 注意: 音频组只能与新音频系统工作，但不会与传统音频工作。

source: NOTE: Before doing a final build of your project for release, you should always clear the Asset Compiler Cache (using the green "broom" icon at the top of the IDE) to ensure that all cached files are recreated and no stale files corrupt your final game.
zh_cn: 注意: 在生成最终文件之前需要清理资源编辑缓存 (点击使用工具栏里的绿色 "扫帚" 图标)来确保生成最终游戏的正确性。

source: NOTE: Currently only Amazon WhisperSync is supported and you must activate it through the Android Tab of the Global Game Settings.
zh_cn: 注意：目前仅支持亚马逊 WhisperSync的服务，你需要在全局设置（Global Game Settings）中的 Android Tab 来激活这个功能。

source: NOTE: Due to the way that this works internally, passing arrays to scripts may affect performance, especially if the array is very large.
zh_cn: 注意： 出于这个内在机制，向脚本传递数组将影响运行效率，尤其是数组非常大时。

source: NOTE: If you are resizing the application surface, these changes will not be registered until the start of the next draw frame, meaning that calling the surface_get_width() or surface_get_height() functions in the same event or step will return the previous values.
zh_cn: 注：如果你重置应用表面层的大小，它不会马上发生改变，直至下一个绘制帧，这意味着在同一个事件或者步事件中使用 surface_get_width() 或者 surface_get_height() 函数将返回之前的值。

source: NOTE: If your HTML5 game uses a custom index.html and that sets the canvas to a fixed position then this function will have no effect on the window position.
zh_cn: 注意: 如果你的 HTML5 游戏使用用户自定义的index.html ，并且设置画布（canvas）至固定的位置，那么这个函数在窗口位置将无效。

source: NOTE: Many of the watch windows (like Global, Local or Watches) will not update while the game is running, and will require that you pause the game or set a breakpoint before they are updated.
zh_cn: 注意：许多监视窗口（例如全局，局部，或监视）并不会在游戏运行时更新，它们需要你暂停游戏或者在它们更新前设置断点。

source: NOTE: On Windows8 SurfaceRT devices, there is a canvas limit of 2048x2048, which means the drawing canvas cannot go above those dimensions (neither with views, nor by setting the game window directly) otherwise your game graphics will be corrupted or degraded.
zh_cn: 注： Windows8 SurfaceRT 设备限制了画布大小为 2048x2048，这意味着绘制的画布不能超过这个尺寸（视野或者直接设置游戏窗口都不可以），否则游戏画面将不堪忍受或降级。

source: NOTE: On the YoYo Compiler target platforms (those marked (YYC)), these expressions are evaluated from left to right, while on all other target platforms they are evaluated from right to left, meaning that this:
zh_cn: 注意： 在YYC目标平台（即标记YYC的目标平台），这些表达式是从左到右进行求值的，而在其它目标平台可能会是从右到左，这意味着：

source: NOTE: The YYC is not available for the HTML5 target, nor any of those that are JavaScript (JS) based.
zh_cn: 注意: YYC 不适用于 HTML5 目标平台, 以及任何基于 JavaScript (JS) 的平台。

source: NOTE: The above is not necessary if you are not changing any of the array values, but rather simply referencing them.
zh_cn: 注意： 如果不更改数组的值， 没有 必要那写，仅需要引用即可。

source: NOTE: The only thing you cannot do with the application surface is free it.
zh_cn: 注： 唯一你 不可以 操作的是释放应用表面层。

source: NOTE: These extra modules can only be bought if you have already upgraded to GameMaker: Studio - Professional.
zh_cn: 注意: 如果你已经更新到了 GameMaker: Studio - Professional，这些额外的模块只能通过购买获得。

source: NOTE: When working with surfaces there is the possibility that they can cease to exist at any time due to them being stored in texture memory.
zh_cn: 注：由于储存在显存里，表面层运行时存在随时停止并退出的可能性。

source: NOTE: Implementing the server-side is entirely up to the end user, and YoYo Games do not provide any support for that side of things, other than basic set-up information available from their Knowledge Base.
zh_cn: 提示: 实现服务器端取决于最终用户，除了基本的设置信息和知识库里提供的信息，YoYo Games不提供任何其他方面的支持。

source: NOTE: The "title" argument is ignored on iOS and the game name is shown instead.
zh_cn: 提示: "title"参数在iOS平台被忽略，系统会自动启用程序名来替代。

source: NOTE: This function is limited to the iOS and Android target modules.
zh_cn: 提示: 这些函数仅适用于iOS 和 Android 平台。

source: New: Choose this command to start creating a new game from scratch.
zh_cn: 新建: 选择此命令可以创建新游戏。

source: New: This will ask you to select the directory you wish to use for a new project and prompt you to enter a name for this project which is then saved and opened in the main GameMaker: Studio runner.
zh_cn: 新建: 选择一个目录、输入工程名以新建工程，进入 GameMaker: Studio 主界面。

source: News: Here you can see the most recent news about the GameMaker range of products and the company YoYo Games.
zh_cn: 新闻: 可以看到 GameMaker 相关产品以及 YoYo Games 公司最近的新闻。

source: News: This will display the most recent news from YoYo Games.
zh_cn: 新闻: 会显示 YoYo Games 最近的新闻。

source: Note: The dot will get interpreted as the decimal point in a real number normally, so, to avoid this, put brackets around it!
zh_cn: 注意： 英文点可以解读为小数点，为避免这个，用括号括起来。

source: Open GameMaker in Explorer: Use this command to open the folder location of GameMaker: Studio in Windows Explorer.
zh_cn: 在资源管理器中打开 GameMaker: 打开 GameMaker: Studio 文件夹的位置。

source: Open Project in Explorer: Use this command to open the folder location of your current project in Windows Explorer.
zh_cn: 在资源管理器中打开工程文件夹: 打开工程文件夹的位置。

source: Open: Here you can browse your computer for files to open.
zh_cn: 打开: 打开电脑上的文件。

source: Open: Opens a GameMaker: Studio game file with the extension *.gmx.
zh_cn: 打开: 打开 *.gmx 格式的 GameMaker: Studio 游戏文件。

source: Path Editor Actions: Here you can select the snap resolution for the path points, as well as toggle the grid visibility on or off.
zh_cn: 路径编辑器操作 : 这里你可以改变路径网格点的分辨率，也可以隐藏或者显示网格点。

source: Path Point Actions: These buttons all change the path points in some way, giving you the ability to clear them completely, mirror them and shift them.
zh_cn: 路径点操作 : 这些按钮都会对路径点进行某种修改，让你可以彻底删除这个路径点，对路径点进行镜像操作或者移动路径点。

source: Path View Actions: You can use these to pan the view of the path around (as the path may be bigger than the visible area in the editor).
zh_cn: 路径视图操作 : 你可以用这些按钮来改变右侧的路径视图（有些时候路径可能比左侧的可视化区域还要大）。

source: Pause: Pauses the game (hotkey = f6).
zh_cn: Pause:暂停游戏。（快捷键：F6）。

source: Play: This starts the game again after it has been paused (hotkey = f5).
zh_cn: Play:这个按钮让你暂停掉的游戏启动起来（快捷键F5）。

source: Preferences: This will open the GameMaker: Studio preferences where you can adjust how the program looks as well as different behaviours when dealing with resources etc...
zh_cn: 配置: 将打开 GameMaker: Studio 的配置，你可以在这里调整程序外观以及不同的行为。

source: Private - The game will only be visible to you, Steam administrators, and anyone marked as co-creator.
zh_cn: 私人的 - 只有你、Steam 管理员和制作游戏合作者才能看到。

source: Properties: All resources have a properties form that can be brought up by selecting this command.
zh_cn: 属性: 打开资源的属性。

source: Public - The game is available to the general public through the Steam Workshop.
zh_cn: 公共的 - 游戏提供给 Steam 创意工坊，所有人都可以搜索到。

source: RealTime Updates: Turn on or off (it is off by default) real time updates for the debug information.
zh_cn: RealTime Updates: 打开或者关闭（默认关闭）实时更新调试信息。

source: Recent Files: Use this sub-menu to open game files you have recently opened or modified.
zh_cn: 最近的文件: 使用这个子菜单打开最近打开的文件。

source: Release Notes: If you click on this button you can see the release notes for each released version of GameMaker: Studio.
zh_cn: 更新日志: 你可以看到 GameMaker: Studio 每个版本的更新日志。

source: Release Notes: Opens a tab in your browser to show the current build and accompanying release notes for your version of GameMaker: Studio.
zh_cn: 更新日志: 在你的浏览器里打开一个网页显示更新日志以及你正在使用的 GameMaker: Studio 版本。

source: Rename: Gives the resource a new name.
zh_cn: 重命名: 给资源重命名。

source: Report A bug: While we make every effort to make sure GameMaker: Studio is bug free, in a program as large and complicated as this it is a nearly impossible task.
zh_cn: 报告错误: 尽管我们尽力使 GameMaker: Studio 没有 bug，然而对于如此庞大而复杂的程序这是基本不可能的。

source: Restart: Restarts the game.
zh_cn: Restart: 重启游戏。

source: Returns: Array
zh_cn: 返回： 数组

source: Returns: Boolean
zh_cn: 返回: 布尔值

source: Returns: Constant
zh_cn: 返回： 常量

source: Returns: N/A
zh_cn: 返回： N/A

source: Returns: Pointer
zh_cn: 返回： 指针

source: Returns: Real
zh_cn: 返回： 实数

source: Returns:Constant
zh_cn: 返回:常量

source: Returns:N/A
zh_cn: 返回：N/A

source: Returns:Real
zh_cn: 返回：实数

source: Room Creation Code.
zh_cn: 房间创建时代码（Room Creation Code）.

source: Save All: Saves the game project file under its current name with the *.gmx extension.
zh_cn: 全部保存: 保存工程文件为 *.gmx 格式。

source: Save As: Saves the current game project file under a different name.
zh_cn: 另存为: 保存当前游戏工程文件为另一个名字。

source: Save: Saves the game project file under its current name with the *.gmx extension.
zh_cn: 保存: 保存当前名字的 *.gmx 格式文件。

source: Scripts.
zh_cn: 脚本.

source: Shift.
zh_cn: Shift 平移.

source: Shortcut: The name of the command to create a keyboard shortcut for.
zh_cn: 命令名: 需要创建快捷键的命令名。

source: Show Object Information: It is sometimes necessary to see all the details of an object and its properties in one place, and this can be achieved by selecting this command.
zh_cn: 显示物体信息: 显示物体有关信息。

source: Spread.
zh_cn: Spread 伸缩.

source: Steam Workshop is basically a platform for user-generated content, where you can upload your games and have others play them, rate them and comment on them.
zh_cn: Steam Workshop 是一个基础用户平台，在那里你可以上传你的游戏或者玩别人的游戏，评估和评论他们。

source: Step In: Step into a code block or script (hotkey = f11).
zh_cn: Step In:跳入一个代码块或脚本（热键： F11）。

source: Step Out: Step out of a code block or script (hotkey = <SHIFT> + f11).
zh_cn: Step Out: 跳出一个代码块或脚本（热键：<SHIFT> + F11）。

source: Step Over: Step over a code block or script (hotkey = f10).
zh_cn: Step Over: 跳过一个代码块或脚本（热键：F10）。

source: Transparent Background Settings: Here you can indicate how the transparent area of the sprite and background resources should be shown in the sprite editor.
zh_cn: 透明背景设置: 设置精灵和背景资源编辑器的透明区域显示方式。

source: Tutorials: This tab shows you a selection of tutorials that come with GameMaker: Studio.
zh_cn: 教程: 这个选项卡用来让你选择 GameMaker: Studio 教程。

source: Undo: This is a simple, one level, undo button.
zh_cn: 撤销 : 这个按钮功能很简单，撤销一次操作。
